---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.#ctor
source: html/908ebe70-64a9-a765-23d7-04f63fa5f937.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.#ctor Method

Initializes a new instance of the TemperatureRatingTypeSet class

## Syntax (C#)
```csharp
public TemperatureRatingTypeSet()
```